LEXICON_RU = {
    '/start': "<b>Привет!👋 Я бот Ичираку🍥</b>\n\n"
              "<i>В целом я пока мало что умею, но я развиваюсь и совершенствуюсь каждый день</i>🤖\n\n"
              "Посмотреть что умею: /help\n\n"
              "По вопросам сюда: @faralost",
    '/help': "*Фото Сакуры🐈 /sakura\n"
             "*Фото Какуры🐒 /kakura\n"
             "*Интересный факт📰 /fact\n"
             "*Цитата из Наруто🍥 /naruto\n"
             "*Фотка со свадьбы Эмира и Айжан🕺💃 /wedding\n"
             "*Сыграть в Угадай Число🎮 /game\n\n"
             "-Начни запрос со слова <i><b>gpt</b></i> и тебе ответит нейронка OpenAI💻\n"
             "-Любое другое написанное вами мне я вам просто отзеркалю🪞",
    'rock': 'Камень 🗿',
}
